
## Plan Result (stg)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 5 to change, 4 to destroy.</code></pre>

* Update
  * azurerm_api_management_subscription.product[0]
  * module.action-group.azurerm_resource_group_template_deployment.action-group
  * module.apim_product[0].azurerm_api_management_product.product
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_schedule.client_serects
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_schedule.client_serects_trigger_once
* Replace
  * azurerm_storage_blob.b2c_policy_files[&#34;reset-pw-en.html&#34;]
  * azurerm_storage_blob.b2c_policy_files[&#34;reset-pw.css&#34;]
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_job_schedule.client_serects
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_job_schedule.client_serects_trigger_once


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_subscription.product[0] will be updated in-place
  ~ resource "azurerm_api_management_subscription" "product" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/subscriptions/d5a0ba59-f5ac-4e05-9650-2e5734c17e29"
        # (8 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_policy_files["reset-pw-en.html"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_policy_files" {
      ~ access_tier            = "Cool" -> (known after apply)
      - content_md5            = "2f5695bc7c0f05e5aed525cbd70ff230" -> null # forces replacement
      ~ id                     = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/reset-pw-en.html" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "reset-pw-en.html"
      ~ url                    = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/reset-pw-en.html" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_policy_files["reset-pw.css"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_policy_files" {
      ~ access_tier            = "Cool" -> (known after apply)
      - content_md5            = "bd1cec3e28b9264eb45bea8e95912e10" -> null # forces replacement
      ~ id                     = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/reset-pw.css" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "reset-pw.css"
      ~ url                    = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/reset-pw.css" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Resources/deployments/CaTH-Group"
        name                = "CaTH-Group"
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.apim_product[0].azurerm_api_management_product.product will be updated in-place
  ~ resource "azurerm_api_management_product" "product" {
        id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/products/pip-product-stg"
      ~ subscriptions_limit   = 0 -> 20
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_job_schedule.client_serects must be replaced
-/+ resource "azurerm_automation_job_schedule" "client_serects" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/jobSchedules/d0775d3f-b81d-4b02-b3a4-2eb36aa99e94" -> (known after apply)
      ~ job_schedule_id         = "d0775d3f-b81d-4b02-b3a4-2eb36aa99e94" -> (known after apply)
      ~ parameters              = { # forces replacement
          ~ "application_id_collection" = "/applications/230bec9c-3991-4499-abe3-e58276a7dd99,/applications/c3c0f9b5-dfad-4d2b-8f20-4164db16900e" -> "230bec9c-3991-4499-abe3-e58276a7dd99,c3c0f9b5-dfad-4d2b-8f20-4164db16900e"
            # (9 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_job_schedule.client_serects_trigger_once must be replaced
-/+ resource "azurerm_automation_job_schedule" "client_serects_trigger_once" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/jobSchedules/d0538895-67a7-4960-88e5-46f105477052" -> (known after apply)
      ~ job_schedule_id         = "d0538895-67a7-4960-88e5-46f105477052" -> (known after apply)
      ~ parameters              = { # forces replacement
          ~ "application_id_collection" = "/applications/230bec9c-3991-4499-abe3-e58276a7dd99,/applications/c3c0f9b5-dfad-4d2b-8f20-4164db16900e" -> "230bec9c-3991-4499-abe3-e58276a7dd99,c3c0f9b5-dfad-4d2b-8f20-4164db16900e"
            # (9 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_schedule.client_serects will be updated in-place
  ~ resource "azurerm_automation_schedule" "client_serects" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/schedules/rotate-client-secrets-schedule"
        name                    = "rotate-client-secrets-schedule"
      ~ start_time              = "2024-03-27T01:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_schedule.client_serects_trigger_once will be updated in-place
  ~ resource "azurerm_automation_schedule" "client_serects_trigger_once" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/schedules/rotate-client-secrets-schedule-single-trigger"
        name                    = "rotate-client-secrets-schedule-single-trigger"
      ~ start_time              = "2024-03-26T11:55:00Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 4 to add, 5 to change, 4 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":163,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->